posts/mel_the_programmer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Reaction to "The Story of Mel"</title>
<!-- 05/07/2018 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="David Bjergaard" />
<link rel="stylesheet" type="text/css" href="../style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Reaction to "The Story of Mel"</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><a href="../index.html">Home</a></td>
<td class="left"><a href="../about.html">About</a></td>
<td class="left"><a href="../gallery.html">Gallery</a></td>
<td class="left"><a href="../links.html">Links</a></td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>Started writing: <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-08-03 Mon&gt;</span></span>
</li>
<li>Posted: <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-08-21 Fri&gt;</span></span>
</li>
<li>Estimated time to read: 5 min
</li>
</ul>

<p>
For the uninitiated "<a href="https://www.cs.utah.edu/~elb/folklore/mel.html">The Story of Mel</a>" is a free verse poem (usenet,
hacking). It describes a programmer so in tune with the hardware he
programs for that he writes directly in machine code.  No compiler
necessary, language, what language? Just Op codes and registers.  I
recently became acquainted with this piece of usenet folklore in a
blog <a href="http://jamesseibel.com/blog/?p=109">explaining how Mel pulled off his feats of grandeur</a>.  I would
like to highlight some issues with venerating programmers like Mel's
method. I will also discuss what lessons I think that Mel's story can
teach us today.
</p>

<p>
To be clear, Mel approached programming not as an exercise in the
abstract, but as an engineering task.  The way that the term "software
engineer" conjures images of men with true grit. These engineers compose electrons to
build virtual bridges or skyscrapers. They take their lunch casually
1500ft from certain death.  Mel wasn't programming so much as he was
configuring a machine of infinite possibility. Mel's program played blackjack with
potential customers.
</p>

<p>
While there is no hard evidence, it is likely that Mel is Mel Kaye. He
wrote a <a href="https://en.wikipedia.org/wiki/LGP-30">compiler for the LGP-30</a>. For the purposes of this article I'm
going focus on Mel's method (writing in hex).  Mel's method makes it
impossible for another programmer to pick up and immediately
understand.  Other RPC-4000 programmers were capable of dissecting his
code to understand his meaning, but not without significant effort. In
writing in the raw hexadecimal<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> Mel obfuscates his meaning.  The
human element is completely removed from his task.
</p>

<p>
Computer programs are expressions of ideas first, and produce results
when run on machines second.  If this order is confused, or the first
part ignored, the whole enterprise falls apart.  Indeed, when Ed
Nather is tasked with finding a bug in Mel's program it takes him
weeks to dissect what is happening. He gives up after
finally grokking a non-infinite infinite loop.  
</p>

<p>
At this point, some audience members may be thinking "uh oh I know
where he's going." The rest of the discussion will be
about the importance of writing and maintaining documentation.  I want
to argue the opposite. Good documentation is very important. When
it comes to writing code that humans can read, documentation should
take a back seat to clear code.
</p>

<p>
What do I mean by clear code? I mean approaching the problem the way
one approaches writing literature.  After all, computer programs are
first ways to communicate ideas, and second something a machine
understands<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>. If we take this attitude when writing code then
becomes an exercise in editing.
</p>

<p>
Taking this perspective, instead of the success condition being "it
does what I want" and "if it ain't broke don't fix it," there is a
framework for development.  The idea is to approach code the way you
approach literature. Your first draft is getting your ideas on the
page. Editing from the first draft replaces "once it works I'm done."
You would never publish the first draft of anything.  In the same way
that you should never publish the first working version of a program.
In the parlance of test driven design, this is the refactor of "<a href="http://www.jamesshore.com/Blog/Red-Green-Refactor.html">Red,
Green, Refactor</a>".
</p>

<p>
So how does Mel fit into this perspective? Mel understood the machine
he was writing code for inside out.  This should not
be abandoned completely at the cost of making computer code
understandable by humans. It is where and how Mel's tricks should be
used that make the difference.  
</p>

<p>
One of the amazing things about a computer is how it is suited for
layers of abstraction.  One can follow these layers up and down. At
one level you can reason about problems in number theory. At another
you can look at how the silicone is laid out to allow a particular
junction to work. A programmer like Mel would be able to take
advantage of the system's quirks in the compiler.  Everyone would
benefit from Mel's low level understanding of the system.
</p>

<p>
For example, Mel exploited the time it took for the drum memory to
rotate to avoid a time-delay loop when interfacing with the
<a href="https://en.wikipedia.org/wiki/Friden_Flexowriter">Flexowriter</a>. He could orchestrate things so that the minimum amount of
time was used waiting for the Flexowriter.  This is a clever
optimization. If Mel had been able to incorporate it as an
optimization for the Fortran compiler, everyone would have benefit
from this trick.  This would allow everyone coding on the RPC-4000 to
enjoy faster programs. Programmers wouldn't worry about the
intricacies of drum memory. Instead, Mel wrote these optimization
tricks directly into his code. It always outperformed the equivalent
Fortran compiler, and impressed potential clients.  This was the clear
win for the company that justified Mel's unorthodox approach to
programming.
</p>

<p>
What have we learned from analyzing this piece of Usenet lore? Knowing
the computer inside out from top to bottom is valuable.  This
knowledge can be used to make computers run programs really fast.  It
is better to apply this knowledge to a system that everyone will
benefit from.  Finally, it is important to write clear code that other
people understand.
</p>

<p>
If you have any comments, you can tweet me <a href="https://twitter.com/dec4fc0ffee">@dec4fc0ffee</a>.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
The closest modern equivalent would be writing the elf by hand
in Linux, or an executable (.exe) on Windows
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
Depending where in the chain you draw the line&#x2026; Almost all
languages are compiled or interpreted, meaning what the programmer
writes gets processed by another program who's job is to make the
computer do something.
</p></div>


</div>
</div></div>
</body>
</html>
